Repository: stephenmcd/mezzanine
Catalog: mezzanine/twitter/locale/*/LC_MESSAGES/django.po
Languages: fi, nl

source: User
fi: Käyttäjä
nl: Gebruiker

source: List
fi: Lista
nl: Lijst

source: Search
fi: Hae
nl: Zoek

source: Default Twitter Query Type
fi: Oletushakutyyppi Twitteristä
nl: Standaard Twitter zoekterm type

source: Type of query that will be used to retrieve tweets for the default Twitter feed.
fi: Haun tyyppi joka näytetään Twitter-syötteessä.
nl: Het type zoekterm dat gebruikt wordt om tweets voor de standaard Twitter feed op te halen. Standaard wordt de Twitter search interface, http://search.twitter.com, aangesproken.

source: Default Twitter Query
fi: Oletushaku Twitteristä
nl: Standaard Twitter zoekterm

source: Twitter query to use for the default query type.
fi: Twitter-haku jota käytetään oletushakutyypissä.
nl: Zoekterm die standaard gebruikt wordt voor het standaard zoekterm type.

source: Default Number of Tweets
fi: Twiittien määrä
nl: Standaard aantal tweets

source: Number of tweets to display in the default Twitter feed.
fi: Määrä twiittejä jotka syötteessä näytetään.
nl: Het aantal tweets dat standaard in de Twitter feed getoond wordt.

source: Type
fi: Tyyppi

source: Value
fi: Arvo
nl: Waarde

source: Twitter query
fi: Twitter-haku
nl: Twitter zoekterm

source: Twitter queries
fi: Twitter-haut
nl: Twitter zoektermen

source: Date/time
fi: Pvm/aika
nl: Datum/tijd

source: Message
fi: Viesti
nl: Bericht

source: Profile image URL
fi: Profiilikuvan URL
nl: URL van profielafbeelding

source: User name
fi: Käyttäjätunnus
nl: Gebruikersnaam

source: Full name
fi: Koko nimi
nl: Volledige naam

source: Profile image URL (Retweeted by)
fi: Profiilikuvan URL (uudelleentwiittaaja)
nl: URL van profielafbeelding (van retweeter)

source: User name (Retweeted by)
fi: Käyttäjätunnus (uudelleentwiittaaja)
nl: Gebruikersnaam (van retweeter)

source: Full name (Retweeted by)
fi: Koko nimi (uudelleentwiittaaja)
nl: Volledige naam (van retweeter)

source: Tweet
fi: Twiitti

source: Tweets
fi: Twiitit

source: Recent Tweets
fi: Uudet twiitit
nl: Recente tweets

source: ago
fi: sitten
nl: geleden
