Repository: stephenmcd/mezzanine
Catalog: mezzanine/pages/locale/*/LC_MESSAGES/django.po
Languages: de

source: Top navigation bar
de: Hauptnavigationsleiste

source: Left-hand tree
de: Navigationsbaum links

source: Footer
de: Fußbereich

source: Show in menus
de: In Menüs anzeigen

source: Login required
de: Anmeldung benötigt

source: If checked, only logged in users can view this page
de: Wenn aktiviert, ist diese Seite nur für angemeldete User sichtbar.

source: Page
de: Seite

source: Pages
de: Seiten

source: Rich text page
de: Seite mit formatiertem Text

source: Rich text pages
de: Seiten mit formatiertem Text

source: Add
de: Hinzufügen

source: An error occured with the following class. Does it subclass Page directly?
de: Ein Fehler trat mit der folgenden Klasse auf. Ist es eine direkte Unterklasse zur Seite?
