Repository: stephenmcd/mezzanine
Catalog: docs/locale/*/LC_MESSAGES/content-architecture.po
Languages: es

source: Content Architecture
es: Arquitectura de contenido

source: Content in Mezzanine primarily revolves around the models found in two packages, ``mezzanine.core`` and ``mezzanine.pages``. Many of these models are abstract, and very small in scope, and are then combined together as the building blocks that form the models you'll actually be exposed to, such as ``mezzanine.core.models.Displayable`` and ``mezzanine.core.pages.Page``, which are the two main models you will inherit from when building your own models for content types.
es: En Mezzanine, el contenido gira alrededor de los modelos que se encuentran dos paquetes: ``mezzanine.core`` y ``mezzanine.pages``. Muchos de estos modelos son abstractos y de un alcance pequeño, y son combinados como los bloques de construcción de los modelos a los que el desarrollador es expuesto. Este es el caso de ``mezzanine.core.models.Displayable`` y ``mezzanine.core.pages.Page``, los cuales son los dos modelos principales de los cuales se debe heredar para construir modelos propios para tipos de contenidos.

source: Before we look at ``Displayable`` and ``Page``, here's a quick list of all the abstract models used to build them:
es: Antes de echar un vistazo a ``Displayable`` y ``Page``, se presenta la lista de modelos abstractos de los que están construidos:

source: ``mezzanine.core.models.SiteRelated`` - Contains a related ``django.contrib.sites.models.Site`` field.
es: ``mezzanine.core.models.SiteRelated`` - Contiene un campo relacionado a ``django.contrib.sites.models.Site``.

source: ``mezzanine.core.models.Slugged`` - Implements a title and URL (slug).
es: ``mezzanine.core.models.Slugged`` - Implementa un título y URL (slug).

source: ``mezzanine.core.models.MetaData`` - Provides SEO meta data, such as title, description and keywords.
es: ``mezzanine.core.models.MetaData`` - Provee metadatos para SEO, como título, descripción y palabras clave.

source: ``mezzanine.core.models.TimeStamped`` - Provides created and updated timestamps.
es: ``mezzanine.core.models.TimeStamped`` - Almacena fechas de creación y modificación.

source: ``mezzanine.core.models.Displayable`` - Combines all the models above, then implements publishing features, such as status and dates.
es: ``mezzanine.core.models.Displayable`` - Combina todos los modelos anteriores e implementa características de publicación como estado de publicación y fechas.

source: ``mezzanine.core.models.Ownable`` - Contains a related user field, suitable for content owned by specific authors.
es: ``mezzanine.core.models.Ownable`` - Contiene un campo relacionado a un usuario, ideal para contenido que pertenece a autores específicos.

source: ``mezzanine.core.models.RichText`` - Provides a WYSIWYG editable field.
es: ``mezzanine.core.models.RichText`` - Provee un campo editable LQVELQO.

source: ``mezzanine.core.models.Orderable`` - Used to implement drag/drop ordering of content, whether out of the box as Django admin inlines, or custom such as Mezzanine's page tree.
es: ``mezzanine.core.models.Orderable`` - Utilizado para implementar ordenamiento de contenido por arrastrar-y-soltar, ya sea para instancias Django estándar inline, o instancias personalizadas en el árbol de páginas de Mezzanine.

source: And for completeness, here are the primary content types provided out of the box to end users, that make use of ``Displayable`` and ``Page``:
es: También se presentan los principales tipos de contenido provistos por defecto a los usuarios finales, que hacen uso de ``Displayable`` y ``Page``:

source: ``mezzanine.blog.models.BlogPost`` - Blog posts that subclass ``Displayable`` as they're not part of the site's navigation.
es: ``mezzanine.blog.models.BlogPost`` - Las entradas de blog son subclases de ``Displayable`` ya que no forman parte de la navegación del sitio.

source: ``mezzanine.pages.models.RichTextPage`` - Default ``Page`` subclass, providing a WYSIWYG editable field.
es: ``mezzanine.pages.models.RichTextPage`` - Subclase por defecto de ``Page`` que provee un campo editable LQVELQO.

source: ``mezzanine.pages.models.Link`` - ``Page`` subclass for links pointing to other URLs.
es: ``mezzanine.pages.models.Link`` - Subclase de ``Page`` para enlaces apuntando a otras URLs.

source: ``mezzanine.forms.models.Form`` - ``Page`` subclass for building forms.
es: ``mezzanine.forms.models.Form`` - Subclase de ``Page`` para crear formularios.

source: ``mezzanine.galleries.models.Gallery`` - ``Page`` subclass for building image gallery pages.
es: ``mezzanine.galleries.models.Gallery`` - Subclase de ``Page`` para crear galerías de imágenes.

source: These certainly serve as examples for implementing your own types of content.
es: Estos casos funcionan como ejemplo para implementar tipos de contenido personalizados.

source: ``Displayable`` itself is also an abstract model, that at its simplest, is used to represent content that contains a URL (also known as a slug). It also provides the core features of content such as:
es: ``Displayable`` en sí es un modelo abstracto, que en el caso más simple es utilizado para representar cualquier contenido que contenga una URL (también conocida como slug). Además provee las principales características de contenido como:

source: Meta data such as a title, description and keywords.
es: Meta datos como título, descripción y palabras clave.

source: Auto-generated slug from the title.
es: URL auto-generada del título.

source: Draft/published status with the ability to preview drafts.
es: Esta de publicación (borrador/publicado) con la posibilidad de previsualizar borradores.

source: Pre-dated publishing.
es: Publicación programada.

source: Searchable by Mezzanine's :doc:`search-engine`.
es: Indexable por el :doc:`search-engine` de Mezzanine.

source: Subclassing ``Displayable`` best suits low-level content that doesn't form part of the site's navigation - such as blog posts, or events in a calendar. Unlike ``Page``, there's nothing particularly special about the ``Displayable`` model - it simply provides a common set of features useful to content.
es: Se recomienda que el contenido de bajo nivel que no sea parte de la navegación del sitio sea una subclase de ``Displayable``, esto incluye entradas de blog, o eventos de un calendario . A diferencia de ``Page``, no hay nada especial en cuanto al modelo ``Displayable`` - simplemente provee un conjunto de características comunes de utilidad para el contenido.

source: In contrast, the concrete ``Page`` model forms the primary API for building a Mezzanine site. It extends ``Displayable``, and implements a hierarchical navigation tree. The rest of this section of the documentation will focus on the ``Page`` model, and the way it is used to build all the types of content a site will have available.
es: En contraste, ``Page`` es un modelo concreto que funciona como la API principal para construir un sitio Mezzanine. Es una subclase de ``Displayable`` e implementa un árbol de navegación jerárquico. El resto de este documento se concentrará en el modelo ``Page`` y en la forma en que es utilizado para construir todos los tipos de contenido disponibles.

source: The ``Page`` Model
es: El modelo ``Page``

source: The foundation of a Mezzanine site is the model ``mezzanine.pages.models.Page``. Each ``Page`` instance is stored in a hierarchical tree to form the site's navigation, and an interface for managing the structure of the navigation tree is provided in the admin via ``mezzanine.pages.admin.PageAdmin``. All types of content inherit from the ``Page`` model and Mezzanine provides a default content type via the ``mezzanine.pages.models.RichTextPage`` model which simply contains a WYSIWYG editable field for managing HTML content.
es: El fundamento de un sitio Mezzanine es el modelo ``mezzanine.pages.models.Page``. Cada instancia de ``Page`` es almacenada en un árbol jerárquico que constituye la navegación del sitio. Se provee una interfaz para gestionar la estructura del árbol de navegación en el sitio administrativo a través de ``mezzanine.pages.admin.PageAdmin``. Todo tipo de contenido hereda del modelo ``Page``, y Mezzanine provee el modelo ``mezzanine.pages.models.RichTextPage`` para permitir la edición de contenido HTML a través del campo LQVELQO.

source: Creating Custom Content Types
es: Creación de tipos de contenido personalizados

source: In order to handle different types of pages that require more structured content than provided by the ``RichTextPage`` model, you can simply create your own models that inherit from ``Page``. For example if we wanted to have pages that were authors with books::
es: Para gestionar diferentes tipos de página que requieren contenido más estructurado que el provisto por el modelo ``RichTextPage``, simplemente se deben crear modelos que sean una subclase de ``Page``. Por ejemplo, para crear páginas donde cada una represente un autor con los libros que ha escrito::

source: Next you'll need to register your model with Django's admin to make it available as a content type. If your content type only exposes some new fields that you'd like to make editable in the admin, you can simply register your model using the ``mezzanine.pages.admin.PageAdmin`` class::
es: Luego se debe registrar el modelo con la interfaz administrativa de Django para tenerlo disponible como tipo de contenido. Si el nuevo tipo de contenido sólo expone algunos campos nuevos para ser editados en la interfaz administrativa, sencillamente se debe registar el modelo utilizando la clase ``mezzanine.pages.admin.PageAdmin``::

source: Any regular model fields on your content type will be available when adding or changing an instance of it in the admin. This is similar to Django's behaviour when registering models in the admin without using an admin class, or when using an admin class without fieldsets defined. In these cases all the fields on the model are available in the admin.
es: Todos los campos del modelo estarán disponibles al añadir o editar las instancias del nuevo tipo de contenido en la interfaz administrativa. Esto es similar al comportamiento de Django al registrar modelos en la interfaz administrativa sin utilizar una clase admin, o cuando se utiliza una clase admin sin fieldsets definidos. En estos casos todos los campos del modelo están disponibles en la interfaz administrativa.

source: If however you need to customize your admin class, you can inherit from ``PageAdmin`` and implement your own admin class. The only difference is that you'll need to take a copy of ``PageAdmin.fieldsets`` and modify it if you want to implement your own fieldsets, otherwise you'll lose the fields that the ``Page`` model implements::
es: Si es necesario editar la clase admin, se debe heredar de ``PageAdmin`` e implementar una clase propia. La única diferencia es que será necesario hacer una copia de ``PageAdmin.fieldsets`` y modificarla para implementar fieldsets personalizados, de otra manera se perderán los campos implementados por el modelo ``Page``::

source: When registering content type models with ``PageAdmin`` or subclasses of it, the admin class won't be listed in the admin index page, instead being made available as a type of ``Page`` when creating new pages from the navigation tree.
es: Cuando se registren tipos de contenido usando la clase ``PageAdmin`` o alguna subclase de ella, la clase admin no será mostrada en la página inicial de la interfaz administrativa. En cambio, estará disponible como un nuevo tipo de ``Page`` al crear nuevas páginas en el árbol de navegación.

source: When creating custom content types, you must inherit directly from the ``Page`` model. Further levels of subclassing are currently not supported. Therefore you cannot subclass the ``RichTextPage`` or any other custom content types you create yourself. Should you need to implement a WYSIWYG editable field in the way the ``RichTextPage`` model does, you can simply subclass both ``Page`` and ``RichText``, the latter being imported from ``mezzanine.core.models``.
es: Al crear tipos de contenido personalizados, se debe heredar directamente del modelo ``Page``. Los niveles más profundos de subclases no son soportados actualmente. Esto significa que no se pueden crear subclases basadas en ``RichTextPage`` o ningún otro tipo de contenido personalizado. Si fuera necesario implementar un campo LQVELQO de la misma manera en que ``RichTextPage`` lo hace, simplemente se debe heredar de ``Page`` y ``RichText``. Este último debe ser importado de ``mezzanine.core.models``.

source: Displaying Custom Content Types
es: Mostrando tipos de contenido personalizados

source: When creating models that inherit from the ``Page`` model, multi-table inheritance is used under the hood. This means that when dealing with the page object, an attribute is created from the subclass model's name. So given a ``Page`` instance using the previous example, accessing the ``Author`` instance would be as follows::
es: Al crear modelos que heredan del modelo ``Page``, se utilizará herencia multi-tabla tras escenarios. Esto significa que al tratar con el objeto ``Page`` se le creará un atributo a partir del nombre del modelo personalizado. Teniendo la instancia ``Page`` del ejemplo anterior, la forma de acceder a la instancia del modelo ``Author`` es::

source: And in a template::
es: Y en una plantilla::

source: The ``Page`` model also contains the method ``Page.get_content_model`` for retrieving the custom instance without knowing its type::
es: El modelo ``Page`` también contiene el método ``Page.get_content_model`` para recuperar la instancia del modelo personalizado sin saber su tipo de antemano::

source: Page Templates
es: Plantillas Page

source: The view function ``mezzanine.pages.views.page`` handles returning a ``Page`` instance to a template. By default the template ``pages/page.html`` is used, but if a custom template exists it will be used instead. The check for a custom template will first check for a template with the same name as the ``Page`` instance's slug, and if not then a template with a name derived from the subclass model's name is checked for. So given the above example the templates ``pages/dr-seuss.html`` and ``pages/author.html`` would be checked for respectively.
es: La vista ``mezzanine.pages.views.page`` se encarga de retornar una instancia ``Page`` a una plantilla. Por defecto se utiliza la planitlla ``pages/page.html``, pero si existe una plantilla personalizada se utilizará en su lugar. Primero se verifica si existe una plantilla con la misma slug que la instancia ``Page``. Si no se encuentra, se busca una plantilla con un nombre derivado de la subclase del modelo. Para el ejemplo anterior, se buscarían las planitllas ``pages/dr-seuss.html`` y ``pages/author.html`` respectivamente.

source: The view function further looks through the parent hierarchy of the ``Page``. If a ``Page`` instance with slug ``authors/dr-seuss`` is a child of the ``Page`` with slug ``authors``, the templates ``pages/authors/dr-seuss.html``, ``pages/authors/dr-seuss/author.html``, ``pages/authors/author.html``, ``pages/author.html``, and ``pages/page.html`` would be checked for respectively. This lets you specify a template for all children of a ``Page`` and a different template for the ``Page`` itself. For example, if an additional author were added as a child page of ``authors/dr-seuss`` with the slug ``authors/dr-seuss/theo-lesieg``, the template ``pages/authors/dr-seuss/author.html`` would be among those checked.
es: La vista también verifica la jerarquía ascendente de la instancia ``Page``. Si se tiene una instancia ``Page`` con el slug ``authors/dr-seuss`` y que es hija de la ``Page`` con slug ``authors``, se buscarán todas estas plantillas: ``pages/authors/dr-seuss.html``, ``pages/authors/dr-seuss/author.html``, ``pages/authors/author.html``, ``pages/author.html``, y ``pages/page.html``. Esto permite especificar una plantilla para todos los hijos de una ``Page`` y otra plantilla diferente para una ``Page`` en particular. Por ejemplo, si se añade otro autor como hijo de ``authors/dr-seuss`` con el slug ``authors/dr-seuss/theo-lesieg``, la plantilla ``pages/authors/dr-seuss/author.html`` estaría entre las plantillas verificadas.

source: Overriding vs Extending Templates
es: Sustituir vs Extender plantillas

source: A typical problem that reusable Django apps face, is being able to extend the app's templates rather than overriding them. The app will usually provide templates that the app will look for by name, which allows the developer to create their own versions of the templates in their project's templates directory. However if the template is sufficiently complex, with a good range of extendable template blocks, they need to duplicate all of the features of the template within their own version. This may cause the project's version of the templates to become incompatible as new versions of the upstream app become available.
es: Un problema común con las aplicaciones reutilizables Django es ser capaces de extender una plantilla de la aplicación en vez de sustituirla. La aplicación usualmente provee plantillas que buscará por nombre, lo que permite al desarrollador crear sus propias versiones de las plantillas en la carpeta del proyecto. Sin embargo, si la plantilla es lo suficientemente compleja y con una buena cantidad de bloques extensibles, el desarrollador se verá en la necesidad de duplicar todas las características de la plantilla en su propia versión. Esto puede causar que la versión del proyecto de la plantilla se vuela incompatible a medida que sucedan cambios en la aplicación original.

source: Ideally we would be able to use Django's ``extends`` tag to extend the app's template instead, and only override the template blocks we're interested in. The problem with this however, is that the app will attempt to load the template with a specific name, so we can't override *and* extend a template at the same time, as circular inheritance will occur, e.g. Django thinks the template is trying to extend itself, which is impossible.
es: Idealmente se podría utilizar la etiqueta Django ``extends`` para extender la plantilla de la aplicación y sólo tener que sustituir los bloques de interés para el proyecto. El problema es que la aplicación tratará de cargar la plantilla de acuerdo a un nombre específico, por lo que no se puede sustituir *y* extender una plantilla al mismo tiempo, debido a la herencia circular que ocurre. Al final Django cree que la plantilla trata de extenderse a sí misma, lo que es imposible.

source: To solve this problem, Mezzanine provides the ``overextends`` template tag, which allows you to extend a template with the same name. The ``overextends`` tag works the same way as Django's ``extends`` tag, (in fact it subclasses it), so it must be the first tag in the template. What it does differently is that the template using it will be excluded from loading when Django searches for the template to extend from.
es: Para solucionar este problema Mezzanine provee la etiqueta ``overextends``, que permite extender una plantilla con el mismo nombre. La etiqueta ``overextends`` funciona de la misma forma que la etiqueta Django ``extends`` (de hecho es una subclase de ella), por lo que debe ser la primera etiqueta en aparecer en la plantilla. Lo que hace de manera diferente es que la plantilla que la utilice será excluida del proceso de carga cuando Django busque las plantillas para usar como base de la extensión.

source: Page Processors
es: Procesadores de página

source: So far we've covered how to create and display custom types of pages, but what if we want to extend them further with more advanced features? For example adding a form to the page and handling when a user submits the form. This type of logic would typically go into a view function, but since every ``Page`` instance is handled via the view function ``mezzanine.pages.views.page`` we can't create our own views for pages. Mezzanine solves this problem using *Page Processors*.
es: Hasta ahora se ha cubierto como crear y mostrar tipos de página personalizados, pero ¿qué pasa si se necesitan características más avanzadas? Por ejemplo, añadir un formulario a una página y procesar los datos cuando el usuario envía el formulario. Este tipo de lógica normalmente iría en una vista, pero debido a que todas las instancias de ``Page`` son manejadas por la vista ``mezzanine.pages.views.page``, no se pueden crear vistas personalizadas para las páginas. Mezzanine resuelve este problema utilizando *procesadores de páginas*.

source: *Page Processors* are simply functions that can be associated to any custom ``Page`` models and are then called inside the ``mezzanine.pages.views.page`` view when viewing the associated ``Page`` instance. A Page Processor will always be passed two arguments - the request and the ``Page`` instance, and can either return a dictionary that will be added to the template context, or it can return any of Django's ``HttpResponse`` classes which will override the ``mezzanine.pages.views.page`` view entirely.
es: Los *procesadores de páginas* no son más que funciones que pueden ser asociadas a cualquier modelo ``Page`` personalizado para luego ser llamadas por ``mezzanine.pages.views.page`` cuando se visualiza una instancia ``Page`` relacionada. Un procesador de página siempre recibe dos argumentos - la petición y la instancia ``Page``, y puede retornar un diccionario que será añadido al contexto de la plantilla o cualquiera de las clases ``HttpResponse`` de Django para sustituir por completo a ``mezzanine.pages.views.page``.

source: To associate a Page Processor to a custom ``Page`` model you must create the function for it in a module called ``page_processors.py`` inside one of your ``INSTALLED_APPS`` and decorate it using the decorator ``mezzanine.pages.page_processors.processor_for``.
es: Para asociar un procesador de página a un modelo ``Page`` personalizado se debe crear una función para él en un módulo llamado ``page_processors.py`` dentro de una de las aplicaciones en la lista ``INSTALLED_APPS`` y decorarla usando el decorador ``mezzanine.pages.page_processors.processor_for``.

source: Continuing on from our author example, suppose we want to add an enquiry form to each author page. Our ``page_processors.py`` module in the author app would be as follows::
es: Siguiendo con el ejemplo de los autores, se procederá a añadir un formulario en la página de cada autor. Para ello se creará el módulo ``page_processors.py`` en la aplicación de autores con el siguiente contenido:

source: The ``processor_for`` decorator can also be given a ``slug`` argument rather than a Page subclass. In this case the Page Processor will be run when the exact slug matches the page being viewed.
es: Al decorador ``processor_for`` también se le puede pasar un ``slug`` como argumento en lugar de una subclase de ``Page``. En este caso el procesador de página se ejecutará cuando el slug coincida con la página siendo visualizada.

source: Page Permissions
es: Permisos de páginas
