Repository: stephenmcd/mezzanine
Catalog: docs/locale/*/LC_MESSAGES/content-architecture.po
Languages: es

source: The navigation tree in the admin where pages are managed will take into account any permissions defined using `Django's permission system <http://docs.djangoproject.com/en/dev/topics/auth/#permissions>`_. For example if a logged in user doesn't have permission to add new instances of the ``Author`` model from our previous example, it won't be listed in the types of pages that user can add when viewing the navigation tree in the admin.
es: El árbol de navegación en la interfaz administrativa donde se gestionan todas las páginas tomará en cuenta cualquier permiso definido utilizando el `sistema de permisos de Django <http://docs.djangoproject.com/en/dev/topics/auth/#permissions>`_. Por ejemplo, si el usuario que ha iniciado sesión no tiene permiso para añadir nuevas instancias del modelo ``Author`` del ejemplo anterior, ese modelo no aparecerá en la lista de modelos disponibles para añadir cuando el usuario visualice el árbol de navegación en la interfaz administrativa.

source: In conjunction with Django's permission system, the ``Page`` model also implements the methods ``can_add``, ``can_change``, ``can_delete``, and ``can_move``. These methods provide a way for custom page types to implement their own permissions by being overridden on subclasses of the ``Page`` model.
es: Además del sistema de permisos de Django, el modelo ``Page`` también implementa los métodos ``can_add`` (puede añadir), ``can_change`` (puede editar), ``can_delete`` (puede eliminar), y ``can_move`` (puede mover). Estos métodos permiten a las subclases de ``Page`` implementar su propio sistema de permisos.

source: With the exception of ``can_move``, each of these methods takes a single argument which is the current request object, and return a Boolean. This provides the ability to define custom permission methods with access to the current user as well.
es: Con la excepción de ``can_move``, cada uno de éstos métodos toma un único argumento, que la petición actual, y retorna un booleano. Esto permite definir métodos de permisos personalizados con acceso al usuario actual.

source: The ``can_add`` permission in the context of an existing page has a different meaning than in the context of an overall model as is the case with Django's permission system. In the case of a page instance, ``can_add`` refers to the ability to add child pages.
es: El permiso ``can_add`` en el contexto de una página existente tiene un significado diferente al que tiene en el contexto del modelo en general, como es el caso del sistema de permisos de Django. En el caso de una instancia de un página, ``can_add`` se refiere a la habilidad de añadir páginas hijas.

source: The ``can_move`` method has a slightly different interface, as it needs an additional argument, which is the new parent should the move be completed, and an additional output, which is a message to be displayed when the move is denied. The message helps justify reverting the page to its position prior to the move, and is displayed using Django messages framework. Instead of a Boolean return value, ``can_move`` raises a ``PageMoveException`` when the move is denied, with an optional argument representing the message to be displayed. In any case, ``can_move`` does not return any values.
es: El método ``can_move`` tiene una interfaz ligeramente diferente, ya que necesita un argumento adicional: el nuevo padre que tendrá la página si se completa el movimiento; y debe proveer una salida adicional: el mensaje que se mostrará si se niega el movimiento. El mensaje justifica el regreso de la página a la posición anterior, y se muestra utilizando el sistema de mensajes de Django. En lugar de un valor booleano de retorno, ``can_move`` levanta la excepción ``PageMoveException`` cuando el movimiento es denegado, con el mensaje a mostrar como argumento opcional. En cualquiera caso, ``can_move`` no retorna ningún valor.

source: The ``can_move`` permission can only constrain moving existing pages, and is not observed when creating a new page. If you want to enforce the same rules when creating pages, you need to implement them explicitly through other means, such as the ``save`` method of the model or the ``save_model`` method of the model's admin.
es: El permiso ``can_move`` solo se aplica al movimiento de páginas existentes, y no se toma en cuenta cuando se crea una nueva página. Si es necesario aplicar las mismas reglas al crear páginas, será necesario implementarlas de manera explícita a través de otros medios, como el método ``save`` del modelo o el método ``save_model`` de la clase admin.

source: For example, if our ``Author`` content type should only contain one child page at most, can only be deleted when added as a child page (unless you're a superuser), and cannot be moved to a top-level position, the following permission methods could be implemented::
es: Por ejemplo, se pueden definir permisos para que el modelo ``Author`` cumpla con estas reglas: sólo debe contener un máximo de un descendiente, sólo puede ser eliminado cuando es añadido como hijo (a menos que se sea un superusario), y no puede ser movido a una posición de primer nivel en el árbol::

source: Page Menus
es: Menús de páginas

source: We've looked closely at the aspects of individual pages, now let's look at displaying all of the pages as a hierarchical menu. A typical site may contain several different page menus, for example a menu that shows primary pages on the header of the site, with secondary pages as drop-down lists. Another type of menu would be a full or partial tree in a side-bar on the site. The footer may display a menu with primary and secondary pages grouped together as vertical lists.
es: Se han explorado en detalle los aspectos de las páginas individuales, ahora se verá como mostrarlas en un menú jerárquico. Un sitio web típico puede contener varios menús de páginas, por ejemplo, un menú que muestra las páginas primarias en la cabecera del sitio, con las páginas secundarias como listas desplegables. Otro tipo de menú podría ser un árbol completo o parcial en la barra lateral del sitio. También el pie de página podría mostrar un menú con las páginas primarias y secundarias agrupadas en listas verticales.

source: Mezzanine provides the ``page_menu`` template tag for rendering the above types of page menus, or any other type you can think of. The ``page_menu`` template tag is responsible for rendering a single branch of the page tree at a time, and accepts two optional arguments (you'll usually need to supply at least one of them) in either order. The arguments are the name of a menu template to use for a single branch within the page tree, and the parent menu item for the branch that will be rendered.
es: Mezzanine provee la etiqueta de plantilla ``page_menu`` para generar los tipos menú anteriores, o cualquier otro tipo que se pueda imaginar. La etiqueta ``page_menu`` es responsable de generar una sola rama del árbol de páginas a la vez, y acepta dos argumentos opcionales (por lo general será necesario proveer por lo menos uno de ellos) en cualquier orden. Los argumentos son el nombre de la plantilla a utilizar para una sola rama del árbol de navegación, y el elemento padre de la rama que será generada.

source: The page menu template will be provided with a variable ``page_branch``, which contains a list of pages for the current branch. We can then call the ``page_menu`` template tag for each page in the branch, using the page as the parent argument to render its children. When calling the ``page_menu`` template tag from within a menu template, we don't need to supply the template name again, as it can be inferred. Note that by omitting the parent page argument for the ``page_menu`` template tag, the first branch rendered will be all of the primary pages, that is, all of the pages without a parent.
es: A la plantilla del menú de página se le proveerá de una variable ``page_branch``, que contiene una lista de páginas para la rama actual. Se puede llamar a la etiqueta ``page_menu`` para cada página en la rama, usando la página como el argumento padre para generar sus hijos. Al llamar a la etiqueta ``page_menu`` desde una plantilla de menú, no es necesario proveer el nombre de la plantilla de nuevo, ya que puede ser inferido. Se debe notar que si se omite el argumento padre de la etiqueta ``page_menu``, la primera rama generada será la de páginas primarias, es decir, todas las páginas sin padres.

source: Here's a simple menu example using two template files, that renders the entire page tree using unordered list HTML tags::
es: Se presenta un ejemplo sencillo de menú utilizando dos archivos de plantillas y que genera el árbol de páginas completo usando listas no ordenadas HTML::

source: The first file starts off the menu without specifying a parent page so that primary pages are first rendered, and only passes in the menu template to use. The second file is the actual menu template that includes itself recursively for each branch in the menu. We could even specify a different menu template in the call to ``page_menu`` in our menu template, if we wanted to use a different layout for child pages.
es: El primer archivo comienza el menú sin especificar una página padre para que se generen las páginas primarias primero, y sólo define que plantilla de menú se va a utilizar. El segundo archivo es la plantilla de menú en sí que se incluye a ella misma de manera recursiva para cada rama del menú. Incluso se podría especificar una plantilla de menú distinta en la llamada a ``page_menu`` si se quisiera utilizar una plantilla distinta para las páginas hijas.

source: Filtering Menus
es: Filtrando los menús

source: Each ``Page`` instance has a field ``in_menus`` which specifies which menus the page should appear in. In the admin interface, the ``in_menus`` field is a list of checkboxes for each of the menu templates. The menu choices for the ``in_menus`` field are defined by the ``PAGE_MENU_TEMPLATES`` setting, which is a sequence of menu templates. Each item in the sequence is a three item sequence, containing a unique ID for the template, a label for the template, and the template path. For example in your ``settings.py`` module::
es: Cada instancia de ``Page`` tiene un campo ``in_menus`` que especifica en qué menús debe aparecer la página. En la interfaz administrativa, el campo ``in_menus`` aparece como una lista de casillas de verificación para las plantillas de menú. Las opciones de menú para ``in_menus`` se definen en la variable de configuración ``PAGE_MENU_TEMPLATES``, que es una secuencia de plantillas de menú. Cada elemento es una secuencia de tres elementos que son: un identificador único para la plantilla, un nombre para la plantilla, y la ruta a la plantilla. Por ejemplo, se puede definir en el módulo ``settings.py``::

source: Which of these entries is selected for new pages (all are selected by default) is controlled by the ``PAGE_MENU_TEMPLATES_DEFAULT`` setting. For example, ``PAGE_MENU_TEMPLATES_DEFAULT = (1, 3)`` will cause the admin section to pre-select the "Top navigation bar" and the "Footer" when using the example above.
es: Por defecto, todos los menús aparecen marcados en la lista de casillas de verificación, pero este comportamiento se puede modificar en la variable de configuración ``PAGE_MENU_TEMPLATES_DEFAULT``. Por ejemplo, definir ``PAGE_MENU_TEMPLATES_DEFAULT = (1, 3)`` hará que los menús "Top navigation bar" y "Footer" aparezcan pre-marcados en la interfaz administrativa.

source: The selections made for the ``in_menus`` field on each page don't actually filter a page from being included in the ``page_branch`` variable that contains the list of pages for the current branch. Instead it's used to set the value of ``page.in_menu`` for each page in the menu template, so it's up to your menu template to check the page's ``in_menu`` attribute explicitly, in order to exclude it::
es: Las selecciones hechas en el campo ``in_menus`` de cada página en realidad no evitan que sea incluida en la variable ``page_branch`` que contiene la lista de las páginas en la rama actual. En su lugar, son utilizadas para establecer el valor de ``page.in_menu`` para cada página de la plantilla del menú, así que es responsabilidad del desarrollador verificar el atributo ``in_menu`` de manera explícita para cada página, para decidir si debe ser excluida::

source: Note that if a menu template is not defined in the ``PAGE_MENU_TEMPLATES`` setting, the branch pages supplied to it will always have the ``in_menu`` attribute set to ``True``, so the only way this will be ``False`` is if the menu template has been added to ``PAGE_MENU_TEMPLATES``, and then *not* selected for a page in the admin interface.
es: Nótese que si una plantilla de menú no está definida en la variable de configuración ``PAGE_MENU_TEMPLATES``, las ramas de páginas que reciba siempre tendrá el atributo ``in_menu`` establecido como ``True``, por lo que la única forma en que el atributo será ``False`` es si la plantilla ha sido añadida a ``PAGE_MENU_TEMPLATES`` y *no* ha sido seleccionada en la interfaz administrativa.

source: Menu Variables
es: Variables de menú

source: The ``page_menu`` template tag provides a handful of variables, both in the template context, and assigned to each page in the branch, for helping you to build advanced menus.
es: La etiqueta de plantilla ``page_menu`` provee un puñado de variables, todas incluidas en el contexto de la plantilla, y asignadas a cada página en la rama, para ser útiles a la hora de construir menús avanzados.

source: ``page_branch`` - a list of pages for the current branch
es: ``page_branch`` - una lista de páginas en la rama actual

source: ``on_home`` - a boolean for whether the homepage is being viewed
es: ``on_home`` - booleano que representa si se está viendo la página de inicio actualmente

source: ``has_home`` - a boolean for whether a page object exists for the homepage, which is used to check whether a hard-coded link to the homepage should be used in the page menu
es: ``has_home`` - booleano que corresponde a la existencia de una página de inicio, utilizado para verificar si se debe usar una enlace fijo a la página de inicio en el menú de página

source: ``branch_level`` - an integer for the current branch depth
es: ``branch_level`` - un entero para la profundidad de la rama actual

source: ``page_branch_in_menu`` - a boolean for whether this branch should be in the menu (see "filtering menus" below)
es: ``page_branch_in_menu`` - booleano que indica si la rama actual debe aparecer en el menú (ver "filtrando menús" más abajo)

source: ``parent_page`` - a reference to the parent page
es: ``parent_page`` - una referencia a la página padre de la página actual

source: ``page.parent`` - same as ``parent_page``.
es: ``page.parent`` - igual que ``parent_page``

source: ``page.in_menu`` - a boolean for whether the branch page should be in the menu (see "filtering menus" below)
es: ``page.in_menu`` - booleano que indica si la página actual debe aparecer en el menú (ver "filtrando menús" más abajo)

source: ``page.has_children`` - a boolean for whether the branch page has any child pages at all, disregarding the current menu
es: ``page.has_children`` - booleano que indica si la página actual tiene páginas hijas sin importar si aparecen en el menú o no

source: ``page.has_children_in_menu`` - a boolean for whether the branch page has any child pages that appear in the current menu
es: ``page.has_children_in_menu`` - booleano que indica si la página actual tiene páginas hijas que aparezcan en el menú actual

source: ``page.num_children`` - an integer for the number of child pages the branch page has in total, disregarding the current menu
es: ``page.num_children`` - entero que indica el número de páginas hijas de la página actual, sin importar si aparecen en el menú actual o no

source: ``page.num_children_in_menu`` - an integer for the number of child pages the branch page has, that also appear in the current menu
es: ``page.num_children_in_menu`` - entero que indica el número de páginas hijas de la página actual que si aparecen en el menú actual

source: ``page.is_current_child`` - a boolean for whether the branch page is a child of the current page being viewed
es: ``page.is_current_child`` - booleano que indica si la página sobre la que se está iterando es hija de la página que se está viendo

source: ``page.is_current_sibling`` - a boolean for whether the branch page is a sibling (has the same parent) of the current page being viewed
es: ``page.is_current_sibling`` - booleano que indica si la página sobre la que se está iterando es hermana (tiene el mismo padre) que la página que se está visualizando

source: ``page.is_current_parent`` - a boolean for whether the branch page is the direct parent of the current page being viewed.
es: ``page.is_current_parent`` - booleano que indica si la página sobre la que se está iterando es padre de la página siendo visualizada

source: ``page.is_current_or_ascendant`` - a boolean for whether the branch page is the current page being viewed, or an ascendant (parent, grand-parent, etc) of the current page being viewed
es: ``page.is_current_or_ascendant`` - booleano que indica si la página sobre la que se está iterando es la página siendo visualizado o su ascendente (padre, abuelo, etc)

source: ``page.is_primary`` - a boolean for whether the branch page is a primary page (has no parent)
es: ``page.is_primary`` - booleano que indica si la página actual es una página primaria (no tiene padre)

source: ``page.html_id`` - a unique string that can be used as the HTML ID attribute
es: ``page.html_id`` - una cadena única que puede utilizarse como el atributo HTML ID

source: ``page.branch_level`` - an integer for the branch page's depth
es: ``page.branch_level`` - entero que indica la profundidad de la página sobre la que se está iterando

source: Here's a commonly requested example of custom menu logic. Suppose you have primary navigation across the top of the site showing only primary pages, representing sections of the site. You then want to have a tree menu in a sidebar, that displays all pages within the section of the site currently being viewed. To achieve this we recursively move through the page tree, only drilling down through child pages if ``page.is_current_or_ascendant`` is ``True``, or if the page isn't a primary page. The key here is the ``page.is_current_or_ascendant`` check is only applied to the primary page, so all of its descendants end up being rendered. Finally, we also only display the link to each page if it isn't the primary page for the section::
es: A continuación se presenta un ejemplo de lógica personalizada de menú comúnmente solicitado. Supóngase que se tiene una navegación principal con las páginas primarias en la parte superior del sitio. Ahora se quiere agregar una menú de árbol en la barra lateral que muestre todas las páginas de la sección siendo visualizada. Para lograr esto, hay que moverse recursivamente a través del árbol de páginas, entrando al siguiente nivel sólo si ``page.is_currente_or_ascendant`` es ``True``, o si la página siendo visualizada no es primaria. La clave aquí es que la verificación de ``page.is_current_or_ascendant`` solo se aplica a la página primaria para que todos sus descendientes sean renderizados. Finalmente, sólo se muestra el enlace a cada página si no es la página primaria de una sección::

source: Integrating Third-party Apps with Pages
es: Integración de aplicaciones de terceros con las Páginas

source: Sometimes you might need to use regular Django applications within your site, that fall outside of Mezzanine's page structure. Of course this is fine since Mezzanine is just Django - you can simply add the app's urlpatterns to your project's ``urls.py`` module like a regular Django project.
es: A veces será necesario utilizar aplicaciones regulares Django que caigan fuera de la estructura de páginas de Mezzanine. Esto no es ningún problema porque Mezzanine es sencillamente Django - basta con añadir los urlpatterns de la aplicación al módulo ``urls.py`` del proyecto como un proyecto Django normal.

source: A common requirement however is for pages in Mezzanine's navigation to point to the urlpatterns for these regular Django apps. Implementing this simply requires creating a page in the admin, with a URL matching a pattern used by the application. With that in place, the template rendered by the application's view will have a ``page`` variable in its context, that contains the current page object that was created with the same URL. This allows Mezzanine to mark the ``page`` instance as active in the navigation, and to generate breadcrumbs for the ``page`` instance as well.
es: Un requisito común es que las páginas de la navegación de Mezzanine apunten a los urlpatterns de estas aplicaciones regulares Django. Implementar esto requiere simplemente crear una página en la interfaz administrativa con la URL coincidiendo con uno de los patrones de la aplicación. Con esto se logra que la plantilla renderizada por la vista de la aplicación tenga una variable ``page`` en su contexto, la cual contiene el objeto Page creado con la misma URL. Este le permite a Mezzanine marcar la instancia de ``page`` como activa en la navegación, y generar la ruta de páginas hasta la instancia de ``page`` actual.

source: An example of this setup is Mezzanine's blog application, which does not use ``Page`` content types, and is just a regular Django app.
es: Un ejemplo de esta configuración es la aplicación de blog de Mezzanine, que no utiliza los tipos de página ``Page``, y que es nada más una aplicación Django regular.
