Repository: stephenmcd/mezzanine
Catalog: docs/locale/*/LC_MESSAGES/frequently-asked-questions.po
Languages: es

source: `Grappelli <https://github.com/sehmaschine/django-grappelli>`_ and `Filebrowser <https://github.com/sehmaschine/django-filebrowser>`_ are fantastic Django apps, and Mezzanine's admin interface would be much poorer without them. When Mezzanine was first created, both of these apps had packaging issues that went unaddressed for quite some time. Development of Mezzanine moved extremely quickly during its early days, and so the forks `grappelli_safe <https://github.com/stephenmcd/grappelli-safe>`_ and `filebrowser_safe <https://github.com/stephenmcd/filebrowser-safe>`_ were created to allow Mezzanine to be packaged up and installed in a single step.
es: `Grappelli <https://github.com/sehmaschine/django-grappelli>`_ y `Filebrowser <https://github.com/sehmaschine/django-filebrowser>`_ son apps Django fantásticas, y la interfaz administrativa de Mezzanine sería mucho más pobre sin ellas. Durante las primeras fases de desarrollo de Mezzanine, ambas aplicaciones tenían problemas de empaquetado que no fueron resueltas durante un tiempo considerable. Mientras tanto, el desarrollo de Mezzanine se movía a un ritmo veloz, y se crearon los forks `grappelli_safe <https://github.com/stephenmcd/grappelli-safe>`_ y `filebrowser_safe <https://github.com/stephenmcd/filebrowser-safe>`_ para permitir que Mezzanine fuera empaquetado e instalado en un solo paso.

source: Over time the packaging issues were resolved, but Grappelli and Filebrowser took paths that weren't desired in Mezzanine. They're only used in Mezzanine for skinning the admin, and providing a generic media library. Extra features that have been added to Grappelli and Filebrowser along the way, haven't been necessary for Mezzanine.
es: Con el tiempo, los problemas de empaquetado fueron resueltos, pero Grappelli y Filebrowser tomaron caminos que no eran los deseados en Mezzanine. Sólo son utilizados para cambiar la apariencia del admin y para proveer una biblioteca de medios genérica. Las características adicionales que se les han añadido en el camino no han sido necesarias para Mezzanine.

source: Over time, small changes have also been made to the ``grappelli_safe`` and ``filebrowser_safe`` forks, in order to integrate them more closely with Mezzanine. So to this day, the forks are still used as dependencies. They're stable, and have relatively low activity.
es: Con el tiempo, también se han realizado pequeños cambios a los forks ``grappelli_safe`` y ``filebrowser_safe`` para integrarlos más fuertemente con Mezzanine. Hasta este día, los forks se utilizan como dependencias de Mezzanine. Son estables y su actividad es relativamente baja.

source: What is this Pillow dependency?
es: ¿Por qué Pillow es una dependencia?

source: Mezzanine makes use of `Python Imaging Library <http://www.pythonware.com/products/pil/>`_ (PIL) for generating thumbnails. Having PIL as a dependency that gets automatically installed with Mezzanine has caused issues for some people, due to certain issues with PIL's own packaging setup.
es: Mezzanine hace uso de `Python Imaging Library <http://www.pythonware.com/products/pil/>`_ (PIL) para generar miniaturas de imágenes. Algunos usuarios experimentan problemas al instalar PIL automáticamente con Mezzanine debido a como está empaquetado.

source: `Pillow <http://pypi.python.org/pypi/Pillow>`_ is simply a packaging wrapper around PIL that addresses these issues, and ensures PIL is automatically installed correctly when installing Mezzanine. Pillow is only used when PIL is not already installed.
es: `Pillow <http://pypi.python.org/pypi/Pillow>`_ es simplemente un envoltorio de empaquetado alrededor de PIL que se hace cargo de esos problemas, y se asegura que PIL sea instalado correctamente de manera automática al instalar Mezzanine. Pillow sólo es utilizado si PIL no está instalado.

source: Why doesn't Mezzanine have [FEATURE]?
es: ¿Por qué Mezzanine no tiene [CARACTERÍSTICA]?

source: The best answer to this might be found by searching the `mailing list <http://groups.google.com/group/mezzanine-users>`_, where many features that aren't currently in Mezzanine have been thoroughly discussed.
es: La mejor respuesta podría encontrarse buscando en la `lista de correo <http://groups.google.com/group/mezzanine-users>`_, donde se han discutido ampliamente muchas de las características que no forman parte de Mezzanine actualmente.

source: Sometimes the conclusion is that certain features aren't within the scope of what Mezzanine aims to be. Sometimes they're great ideas, yet no one has had the time to implement them yet. In the case of the latter, the quickest way to get your feature added is to get working on it yourself.
es: A veces la conclusión es que algunas características no son parte del alcance de lo que Mezzanine quiere llegar a ser. Otras veces son grandes ideas, pero nadie ha tenido el tiempo para implementarlas. En ese caso, la manera más rápida de añadir una característica a Mezzanine es trabajando en ella uno mismo.

source: Communication via the mailing list is key though. Features have been developed and rejected before, simply because they were relatively large in size, and developed in a silo without any feedback from the community. Unfortunately these types of contributions are difficult to accept, since they have the greatest resource requirements in understanding everything involved, without any previous communication.
es: Hay que tener en cuenta que la comunicación en la lista de correo es clave. Han habido casos en que algunas características han sido desarrolladas solo para ser rechazadas, simplemente por ser de tamaño relativamente grande y ser desarolladas de manera aislada, sin retroalimentación de la comunidad. Lamentablemente es difícil aceptar este tipo de contribuciones, ya que requieren entender todo lo que implican sin haber tenido ningún tipo de comunicación previa.

source: Can I use Cartridge without Mezzanine?
es: ¿Puedo utilizar Cartridge sin Mezzanine?

source: No. `Cartridge <http://cartridge.jupo.org>`_ (an ecommerce app) heavily leverages Mezzanine, and in fact it is implemented as an advanced example of a Mezzanine content type, where each shop category is a page in Mezzanine's navigation tree. This allows for a very flexible shop structure, where hierarchical categories can be set up to create your shop.
es: No. `Cartridge <http://cartridge.jupo.org>`_ (una aplicación de comercio electrónico) se apoya ampliamente en Mezzanine, y de hecho está implementado como un ejemplo avanzado de un tipo de contenido Mezzanine, donde cada categoría de tienda es una página en el árbol de navegación de Mezzanine. Esto permite una estructura de tienda muy flexible, donde se puede crear una jerarquía de categorías para crear la tienda.

source: You could very well use Cartridge and Mezzanine to build a pure Cartridge site, without using any of Mezzanine's features that aren't relevant to Cartridge. However more often than not, you'll find that general content pages and forms, will be required to some extent anyway.
es: Es posible construir un sitio Cartrdige "puro" utilizando Mezzanine y Cartridge dejando fuera todas las características de Mezzanine que no sean relevantes para Cartridge. Sin embargo, por lo general las páginas de contenido y los formularios son necesarios de alguna manera.

source: I don't know how to code, how can I contribute?
es: No puedo programar. ¿Cómo puedo contribuir?

source: You're in luck! Programming is by far the most abundant skill contributed to Mezzanine, and subsequently the least needed. There are many ways to contribute without writing any code:
es: ¡Estás de suerte! La programación es la habilitad contribuida con mayor frecuencia a Mezzanine, lo que la hace la menos necesitada. Hay muchas maneras de contribuir sin escribir código:

source: Answering questions on the `mailing list <http://groups.google.com/group/mezzanine-users>`_
es: Respondiendo preguntas en `lista de correo <http://groups.google.com/group/mezzanine-users>`_

source: Triaging `issues on GitHub <https://github.com/stephenmcd/mezzanine/issues>`_
es: Reportando y clasificando `problemas (issues) en GitHub <https://github.com/stephenmcd/mezzanine/issues>`_

source: Improving the documentation
es: Mejorando la documentación

source: Promoting Mezzanine via blogs, `Twitter <http://twitter.com>`_, etc.
es: Promoviendo Mezzanine en blogs, `Twitter <http://twitter.com>`_, etc.

source: If you don't have time for any of these things, and still want to contribute back to Mezzanine, donations are always welcome and can be made via Flattr or PayPal on the `Mezzanine homepage <http://mezzanine.jupo.org>`_. Donations help to support the continued development of Mezzanine, and go towards paying for infrastructure, such as hosting for the demo site.
es: Si no tienes tiempo para ninguna de las actividades anteriores y aún quieres contribuir a Mezzanine, las donaciones son siempre bienvenidas y pueden realizar a través de Flattr o PayPal en la `página oficial de Mezzanine <http://mezzanine.jupo.org>`_. Las donaciones ayudan a mantener el desarrollo continuo de Mezzanine y son dirigidas a pagar por infraestructura, como el alojamiento web para el sitio demo.
