Repository: stephenmcd/mezzanine
Catalog: docs/locale/*/LC_MESSAGES/frequently-asked-questions.po
Languages: es

source: Frequently Asked Questions
es: Preguntas frecuentes

source: These are some of the most frequently asked questions on the `Mezzanine mailing list <http://groups.google.com/group/mezzanine-users>`_.
es: Estas son algunas de las preguntas hechas con mayor frecuencia en la `lista de correo de Mezzanine <http://groups.google.com/group/mezzanine-users>`_.

source: What do I need to know to use Mezzanine?
es: ¿Qué necesito saber para poder usar Mezzanine?

source: First and foremost, Mezzanine is based on the `Django framework <https://www.djangoproject.com/>`_. All aspects of working with Mezzanine will benefit from a good understanding of how Django works. Many questions that are asked within the Mezzanine community can easily be answered by reading the `Django documentation <https://docs.djangoproject.com/en/>`_.
es: Primero que nada, Mezzanine está basado en el `framework Django <https://www.djangoproject.com/>`_. Todos los aspectos de trabajar con Mezzanine se verán beneficiados de un buen conocimiento de la forma en que Django trabaja. Muchas de las preguntas que se hacen en la comunidad Mezzanine pueden responderse con facilidad leyendo la `documentación de Django <https://docs.djangoproject.com/en/>`_.

source: Setting up a development environment, and deploying a Mezzanine site, is the same process as doing so with a regular Django site. Areas such as version control, installing Python packages, and setting up a web server such as `Apache <http://httpd.apache.org/>`_ or `NGINX <http://nginx.org/>`_, will all be touched upon.
es: Configurar un entorno de desarrollo y desplegar un sitio Mezzanine son actividades que siguen el mismo proceso que un sitio Django regular. Se incluyen cosas como control de versión, instalación de paquetes Python, y la configuración de un servidor web como `Apache <http://httpd.apache.org/>`_ o `NGINX <http://nginx.org/>`_.

source: Modifying the look and feel of a Mezzanine powered site requires at least an understanding of HTML, CSS and `Django's templating system <https://docs.djangoproject.com/en/dev/topics/templates/>`_.
es: Para modificar el aspecto gráfico de un sitio Mezzanine, es necesario entender HTML, CSS y el `lenguaje de plantillas Django <https://docs.djangoproject.com/en/dev/topics/templates/>`_.

source: Extending Mezzanine by :ref:`creating-custom-content-types` or using additional Django apps, will require some knowledge of programming with `Python <http://python.org>`_, as well as a good understanding of Django's components, such as `models <https://docs.djangoproject.com/en/dev/topics/db/models/>`_, `views <https://docs.djangoproject.com/en/dev/topics/http/views/>`_, `urlpatterns <https://docs.djangoproject.com/en/dev/topics/http/urls/>`_ and the `admin <https://docs.djangoproject.com/en/dev/ref/contrib/admin/>`_.
es: Extender Mezzanine con :ref:`creating-custom-content-types` o utilizando apps Django adicionales requiere de conocimientos de programación en `Python <http://python.org>`_, y una buena idea de los componentes de Django, como los `modelos <https://docs.djangoproject.com/en/dev/topics/db/models/>`_, `vistas <https://docs.djangoproject.com/en/dev/topics/http/views/>`_, `urlpatterns <https://docs.djangoproject.com/en/dev/topics/http/urls/>`_ y el `sitio administrativo <https://docs.djangoproject.com/en/dev/ref/contrib/admin/>`_.

source: `Back to top <#>`_
es: `Volver al inicio <#>`_

source: Why aren't my JavaScript and CSS files showing up?
es: ¿Por qué no se muestran mis archivos CSS y Javascript?

source: Mezzanine makes exclusive use of `Django's staticfiles app <https://docs.djangoproject.com/en/dev/ref/contrib/staticfiles/>`_, for managing static files such as JavaScript, CSS, and images.
es: Mezzanine utiliza exclusivamente la `aplicación Django staticfiles <https://docs.djangoproject.com/en/dev/ref/contrib/staticfiles/>`_, para gestionar archivos estáticos como Javascript, CSS e imágenes.

source: When the ``DEBUG`` setting is set to ``True``, as it would be during development, the URL defined by the setting ``STATIC_URL`` (usually ``/static/``), will host any files found in the ``static`` directory of any application listed in the ``INSTALLED_APPS`` setting.
es: Cuando la variable de configuración ``DEBUG`` se establece como ``True``, como se haría durante la fase de desarrollo, la URL definida en la variable de configuración ``STATIC_URL`` (por lo general es ``/static/``), almacenará todos los archivos que se encuentren en la carpeta ``static`` de cada una de las aplicaciones definidas en la variable de configuración ``INSTALLED_APPS``.

source: When ``DEBUG`` is set to ``False``, as it would be for your deployed production site, you must run the ``collectstatic`` command on your live site, which will copy all of the files from the ``static`` directory in each application, to the location defined by the ``STATIC_ROOT`` setting. You then need to configure an alias in your web server's config (Apache, NGINX, etc) that maps the URL defined by ``STATIC_URL`` to serve files from this directory.
es: Cuando ``DEBUG`` se establece como ``False``, como se haría para el sitio web desplegado en producción, se debe ejecutar el comando ``collectstatic`` en el sitio en vivo, que copia todos los archivos de la carpeta ``static`` de cada aplicación a la ubicación definida por la variable de configuración ``STATIC_ROOT``. Luego se debe configurar un alias en el servidor web (Apache, NGINX, etc) que indique que se deben servir los contenidos de este direcotorio bajo la URL definida en ``STATIC_URL``.

source: Long story short, Django doesn't serve static content when deployed in production, leaving this up to the public facing web server, which is absolutely the best tool for this job. Consult `Django's staticfiles guide <https://docs.djangoproject.com/en/dev/howto/static-files/>`_ for more information.
es: En resumen, Django no sirve el contenido estático cuando es desplegado en producción, dejando esta tarea al servidor web con el que interactua el público, que es el mejor capacitado para esta tarea. La `guía de staticfiles de Django <https://docs.djangoproject.com/en/dev/howto/static-files/>`_ contiene más información al respecto.

source: Why does the WYSIWYG editor strip out my custom HTML?
es: ¿Por qué el editor LQVELQO elimina mi HTML personalizado?

source: By default, Mezzanine strips out potentially dangerous HTML from fields controlled by the WYSIWYG editor, such as tags and attributes that could be used to inject JavaScript into a page. If this didn't occur, a clever staff member could potentially add JavaScript to a page, that when viewed by an administrator (a staff member with superuser status), would cause the administrator's browser to post an update via the admin, that updates the staff member's user account and assigns them superuser status.
es: Por defecto, Mezzanine elimina el HTML potencialmente peligroso de los campos controlados por el editor LQVELQO, como etiquetas y atributos que podrían ser utilizados para inyectar Javascript en una página. Si no se hiciera esto, un miembro astuto del staff podría añadir Javascript a una página para que cuando un administrador del sitio (un miembro del staff con permisos de superusuario) visite la página, el navegador automáticamente haga una actualización a través del sitio administrativo y le otorgue permisos elevados al usuario con permisos regulares.

source: The above scenario is a fairly obscure one, so it's possible to customise the level of filtering that occurs. Three levels of filtering are implemented by default, that can be controlled in the settings section of the admin. These are High (the default), Low (which allows extra tags such as those required for embedding videos), and None (no filtering occurs). This is implemented via the ``RICHTEXT_FILTER_LEVEL`` setting.
es: El caso descrito anteriormente no es muy común, por lo que es posible personalizar el nivel de filtrado aplicado. Por defecto, se implementan tres niveles de filtrado que se pueden controlar en la sección de configuración del sitio administrativo. Estos son: Alto (por defecto), Bajo (que permite etiquetas adicionales, como las necesarias para incrustar videos) y Ninguno (no se aplica filtrado). Esto se implementa a través de la variable de configuración ``RICHTEXT_FILTER_LEVEL``.

source: If your situation is one where your staff members are completely trusted, and custom HTML within WYSIWYG fields is required, then you can modify the filter level accordingly. Further customisation is possible via the ``RICHTEXT_ALLOWED_TAGS``, ``RICHTEXT_ALLOWED_ATTRIBUTES`` and ``RICHTEXT_ALLOWED_STYLES`` settings, which can have extra allowed values appended to using the ``append`` argument in Mezzanine's settings API. See the :ref:`registering-settings` section for more information.
es: En caso de que se considere que todos los miembros del staff son de confianza y se requiera HTML personalizado en los campos LQVELQO, se puede modificar el nivel de filtrado aplicado. La personalización avanzada es posible a través de las variables de configuración ``RICHTEXT_ALLOWED_TAGS``, ``RICHTEXT_ALLOWED_ATTRIBUTES`` y ``RICHTEXT_ALLOWED_STYLES``, a las cuales se les pueden añadir valores utilizando el argumento ``append`` en la API de configuración de Mezzanine. La sección :ref:`registering-settings` contiene más información al respecto.

source: Why isn't the homepage a Page object I can edit via the admin?
es: ¿Por qué la página de inicio no es un objecto Page editable desde la interfaz administrativa?

source: In our experience, the homepage of a beautiful, content driven website, is quite different from other pages of the site, that all fall under sets of repeatable page types. The homepage also differs greatly from site to site. Given this, Mezzanine doesn't presume how your homepage will be structured and managed. It's up to you to implement how it works per site.
es: En nuestra experiencia, la página de inicio de un sitio web bonito y orientado a contenido es bastante diferente a las otras páginas del sitio, las cuales forman parte de un patrón repetitivo de tipos de página. La página de inicio también varía ampliamente de sitio a sitio. Con esto en mente, Mezzanine no hace asunciones respecto a como será administrada y estructurada la página de inicio. Es responsabilidad del desarrolladar implementar la página de inicio en cada sitio.

source: By default, the homepage provided with Mezzanine is a static template, namely ``mezzanine/core/templates/index.html`` (or ``templates/index.html`` if stored directly in your project). You can change the ``urlpattern`` for the homepage in your project's ``urls.py`` module. Be certain to take a look at the `urls.py module <https://github.com/stephenmcd/mezzanine/tree/master/mezzanine/project_template/urls.py>`_, as it contains several examples of different types of homepages. In ``urls.py`` you'll find examples of pointing the homepage to a ``Page`` object in the page tree, or pointing the homepage to the blog post listing page, which is useful for sites that are primarily blogs.
es: Por defecto, la página de inicio provista por Mezzanine es una plantilla estática, se encuentra en ``mezzanine/core/templates/index.html`` (o ``templates/index.html`` si se almacena directamente en el proyecto). Se puede cambiar el ``urlpattern`` de la página de inicio en el módulo ``urls.py`` del proyecto. Se recomienda leer los contenidos del `módulo urls.py <https://github.com/stephenmcd/mezzanine/tree/master/mezzanine/project_template/urls.py>`_, ya que contiene varios ejemplos para distintos tipos de página de inicio. En ``urls.py`` se encuentran ejemplos de como apuntar la página de inicio a un objeto ``Page`` en el árbol de páginas, o a una lista de entradas recientes del blog, lo que es útil para sitios que son usados como blogs principalmente.

source: Of course with Django's models, admin classes, and template tags, the sky is the limit and you're free to set up the homepage to be managed in any way you like.
es: Por supuesto, con los modelos, clases de admin y etiquetas de plantillas de Django, el cielo es el límite, y se tiene libertad completa para que la página de inicio sea gestionada de cualquier forma.

source: Why is Mezzanine a Django project, and not a Django app?
es: ¿Por qué es Mezzanine un proyecto Django, y no una app Django?

source: Mezzanine comes with many features that are related to content driven websites, yet are quite distinct from each other. For example user-built forms and blog posts are both common requirements for a website, yet aren't particularly related to each other. So Mezzanine as a whole is a collection of different Django apps, all packaged together to work seamlessly.
es: Mezzanine provee muchas características relacionadas a sitios web orientados a contenido, sin embargo, están bastante separadas unas de otras. Por ejemplo, es común que un sitio web requiera formularios construido por el usuario y un blog, pero estas dos características no están particularmente relacionadas entre ellas. Así que Mezzanine es una colección de apps Django, todas empaquetadas en conjunto para trabajar hombro a hombro.

source: Mezzanine provides its own `project template <https://github.com/stephenmcd/mezzanine/tree/master/mezzanine/project_template>`_, with ``settings.py`` and ``urls.py`` modules that configure all of Mezzanine's apps, which you can (and should) modify per project.
es: Mezzanien incluye su propia `plantilla de proyecto <https://github.com/stephenmcd/mezzanine/tree/master/mezzanine/project_template>`_, con módulos ``settings.py`` y ``urls.py`` que configuran todas las apps de Mezzanine. Estos módulos pueden (y deben) ser editados para cada proyecto.

source: Where are all the templates I can modify?
es: ¿Dónde se encuentran todas las plantillas que puedo modificar?

source: Each of the templates Mezzanine provides can be found in the ``templates`` directory of each Django app that Mezzanine is comprised of. Take the time to explore the structure of these, starting with the base template ``mezzanine/core/templates/base.html`` (or ``templates/base.html`` if stored directly in your project) which is the foundation for the entire site, going more granular as needed.
es: Todas las plantillas provistas por Mezzanine pueden encontrarse en la carpeta ``templates`` de cada app Django incluída con Mezzanine. Se recomienda tomarse un tiempo para explorar la estructura de estas carpetas, empezando con la plantilla base `mezzanine/core/templates/base.html`` (o ``templates/base.html`` si se almacena en el proyecto), que es la fundación de todo el sitio. Desde esta plantilla se incluyen otras que proveen control más granular según sea necesario.

source: Once you're familiar with the templates you'd like to modify, copy them into your project's ``templates`` directory and modify them there. You can also use the ``collecttemplates`` command to copy templates over automatically. Run ``python manage.py collecttemplates --help`` for more info. Be mindful that this means the copied templates will always be used, rather than the ones stored within Mezzanine itself, which is something to keep in mind if you upgrade to a newer version of Mezzanine.
es: Una vez se esté familiarizado con las plantillas que se desea modificar, se deben copiar a la carpeta ``templates`` del proyecto para modificarse allí. También se puede utilizar el comando ``collecttemplates`` para copiar las plantillas automáticamente. Para más información, se puede ejecutar ``python manage.py collecttemplates --help``. Se debe hacer notar que esto implica que las plantillas copiadas al proyecto serán utilizadas de ahora en adelante en lugar de las almacenadas en Mezzanine. Esto debe recordarse especialmente al actualizar a nuevas versiones de Mezzanine.

source: How do I create/install a theme?
es: ¿Cómo crear/instalar temas?

source: Prior to version 1.0, Mezzanine had a set of features for creating and installing themes. These mostly were in place to address handling static files, since at that time Mezzanine was not integrated with `Django's staticfiles app <https://docs.djangoproject.com/en/dev/ref/contrib/staticfiles/>`_. Mezzanine 1.0 makes full use of ``staticfiles``, and so the theming features were removed since they became redundant.
es: Antes de la versión 1.0, Mezzanine tenía un conjunto de características para crear e instalar temas. Esto se debía en gran parte a la necesidad de manejar archivos estáticos, ya que Mezzanine no estaba integrado con la `app staticfiles de Django <https://docs.djangoproject.com/en/dev/ref/contrib/staticfiles/>`_. A partir de Mezzanine 1.0, se hizo uso de ``staticfiles``, y se removieron las características relacionadas a los temas por ser redundantes.

source: From that point on, a theme in Mezzanine can be implemented entirely as a standard Django app. Simply create a Django app with ``templates`` and ``static`` directories, copy the relevant HTML, CSS and JavaScript files into it from Mezzanine that you wish to modify, and then add the theme app's name to your project's ``INSTALLED_APPS`` setting. Be sure to add the theme to the top of the ``INSTALLED_APPS`` list, so that its templates are found before Mezzanine's versions of the templates.
es: De allí en adelante, un tema Mezzanine puede ser implementado en su totalidad como una app Django estándar. Simplemente se debe crear una app Django con las carpetas ``templates`` y ``static``, copiar los archivos HTML, CSS y Javascript que se quieran utilizar desde Mezzanine, y finalizar añadiendo el nombre de la aplicación a la variable de configuración ``INSTALLED_APPS`` del proyecto. El tema debe añadirse al inicio de la lista ``INSTALLED_APPS``, para que sus plantillas sean encontradas antes que las de Mezzanine.

source: Have you created a cool theme that you'd like to share with the community? Package your theme up and put it on `PyPI <http://pypi.python.org/pypi>`_ and let us know via the `mailing list <http://groups.google.com/group/mezzanine-users>`_- that way people can automatically install it along with their Mezzanine project.
es: ¿Has creado un tema genial que te gustaría compartir con la comunidad? Los temas se pueden empaquetar y poner en `PyPI <http://pypi.python.org/pypi>`_, luego haznos saber a través de la `lista de correo <http://groups.google.com/group/mezzanine-users>`_, y así la gente puede instalarlos con facilidad en sus proyectos Mezzanine.

source: Why does Mezzanine contain its own [FEATURE] instead of using [PACKAGE]?
es: ¿Por qué Mezzanine contiene su propia [CARACTERÍSTICA] en lugar de usar tal [PAQUETE]?

source: To be honest you could implement most of Mezzanine's features by gluing together dozens of smaller, stand-alone, open source Django apps. Several larger Django site-building frameworks take this approach, and it's a noble one. The downside to this is that a significant portion of time on your project will be spent maintaining the glue between these apps, as their development evolves independently from each other, as well as from your project itself. At best you'll be able to work with the apps' developers to ease this evolution, at worst you'll be stuck hacking work-arounds for incompatibilities between the apps.
es: Honestamente, sería posible implementar la mayoría de las características de Mezzanine uniendo docenas de aplicaciones Django más pequeñas, independientes y de código abierto. Varios frameworks de desarrollo de sitios web basados en Django utilizan ese enfoque, y es uno noble. La desventaja es que requiere dedicar una gran cantidad de tiempo a mantener el "pegamento" entre cada una de las aplicaciones, ya que cada una se desarrolla de manera independiente a las otras y al proyecto en sí. En el mejor de los casos, sería posible trabajar con los otros desarrolladores para facilitar el proceso de evolución; y en el peor, uno se queda atrapado desarrollando complicados arreglos para conciliar las incompatibilidades entre aplicaciones.

source: One of the core goals of Mezzanine is to avoid this situation, by providing all of the features commonly required by content driven sites, with just the right level of extensibility to customize your Mezzanine powered site as required. By taking this approach, the team behind Mezzanine is in complete control over its components, and can ensure they work together seamlessly.
es: Una de las metas centrales de Mezzanine es evitar esa última situación, y lo hace proveyendo todas las características comúnmente necesitadas en sitios web orientados a contenido con el nivel justo de extensibilidad para alcanzar la personalización necesaria para cada sitio. Siguiendo este enfoque, el equipo detrás de Mezzanine está en completo control de sus componentes, y puede asegurarse que funcionan sin problemas entre sí.

source: How can I add Mezzanine to an existing Django project?
es: ¿Cómo añadir Mezzanine a un proyecto Django existente?

source: Mezzanine is a Django project made up of multiple Django apps, and is geared towards being used as the basis for new Django projects, however adding Mezzanine to an existing Django project should be as simple as adding the necessary settings and urlpatterns.
es: Mezzanine es un proyecto Django compuesto de múltiples apps Django, y está pensado para ser utilizado como una base de proyectos Django nuevos. Sin embargo, añadir Mezzanine a un proyecto existente no debería requerir más que añadir las variables de configuración y urlpatterns necesarios.

source: Mezzanine contains a `project_template directory <https://github.com/stephenmcd/mezzanine/tree/master/mezzanine/project_template>`_, which it uses to create new projects. In here you'll find the necessary ``settings.py`` and ``urls.py`` modules, containing the project-level setup for Mezzanine. Of particular note are the following settings:
es: Mezzanine contiene una carpeta llamada `project_template <https://github.com/stephenmcd/mezzanine/tree/master/mezzanine/project_template>`_, la cual es utilizada para crear nuevos proyectos. En ella se encuentran los módulos ``settings.py`` y ``urls.py`` que contienen la configuración de Mezzanine a nivel de proyecto. A continuación se describen algunas variables de configuración de especial interés:

source: ``INSTALLED_APPS``
es: ``PACKAGE_NAME_GRAPPELLI`` y ``PACKAGE_NAME_FILEBROWSER`` (para integración con `django-grappelli <https://github.com/sehmaschine/django-grappelli>`_ y `django-filebrowser <https://github.com/sehmaschine/django-filebrowser>`_)

source: The call to ``mezzanine.utils.conf.set_dynamic_settings`` at the very end of the ``settings.py`` module.
es: La llamada a ``mezzanine.utils.conf.set_dynamic_settings`` justo al final del módulo ``settings.py``.

source: Why are Grappelli and Filebrowser forked?
es: ¿Por qué se hicieron forks de Grappelli y Filebrowser?
